app/controllers/commecial_units_controller.rb

  def index
    @commecial_units = CommecialUnit.all
---
SELECT "commecial_units".* FROM "commecial_units"

  def create
    @commecial_unit = CommecialUnit.new(commecial_unit_params)

    respond_to do |format|
      if @commecial_unit.save
---
INSERT INTO "commecial_units" ("owner", "address", "shops", "sqmt", "parking", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["owner", "a"], ["address", "ssf"], ["shops", 3], ["sqmt", 3], ["parking", 5], ["price", "5.0"], ["created_at", "2020-10-22 10:59:05.966361"], ["updated_at", "2020-10-22 10:59:05.966361"]]

    def set_commecial_unit
      @commecial_unit = CommecialUnit.find(params[:id])
---
SELECT  "commecial_units".* FROM "commecial_units" WHERE "commecial_units"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]