app/controllers/complex_buildings_controller.rb

  def index
    @complex_buildings = ComplexBuilding.all
---
SELECT "complex_buildings".* FROM "complex_buildings"

  def create
    @complex_building = ComplexBuilding.new(complex_building_params)

    respond_to do |format|
      if @complex_building.save
---
INSERT INTO "complex_buildings" ("owner", "address", "created_at", "updated_at", "picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_complex_building
      @complex_building = ComplexBuilding.find(params[:id])
---
SELECT  "complex_buildings".* FROM "complex_buildings" WHERE "complex_buildings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]