app/controllers/houses_controller.rb

INSERT INTO "houses" ("owner", "address", "air_cond", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["owner", "mnn "], ["address", ""], ["air_cond", false], ["created_at", "2020-10-21 18:23:04.225992"], ["updated_at", "2020-10-21 18:23:04.225992"]]
---
  def create
    @house = House.new(house_params)

    respond_to do |format|
      if @house.save

UPDATE "houses" SET "picture_file_name" = $1, "picture_content_type" = $2, "picture_file_size" = $3, "picture_updated_at" = $4, "updated_at" = $5 WHERE "houses"."id" = $6
---
  def update
    respond_to do |format|
      if @house.update(house_params)