app/controllers/pages_controller.rb

SELECT "commecial_units".* FROM "commecial_units"
SELECT "complex_buildings".* FROM "complex_buildings"
---
    def home
        @assets = (House.all + ComplexBuilding.all + CommecialUnit.all).sort_by(&:created_at)